""" 1 """
""" a = int(input("Введіть перше число: "))
b = int(input("Введіть друге число: "))


if a > b:
    print("Перше число більше другого")
elif a < b:
    print("Перше число менше другого")
elif a >= b:
    print("Перше число більше або рівне другому")
elif a <= b:
    print("Перше число менше або рівне другому")
elif a == b:
    print("Числа рівні")
elif a != b:
    print("Числа не рівні") """

""" 2 """
""" str1 = input("Введіть перший рядок: ")
str2 = input("Введіть другий рядок: ")


print(str1 * 5)


if str1 in str2:
    print("Перший рядок входить в другий")
else:
    print("Перший рядок не входить в другий")


if str2 not in str1:
    print("Другий рядок не входить в перший")
else:
    print("Другий рядок входить в перший") """

""" 3 """

""" a = 201
b = 746
# & - and
print(bin(a)[2:])
print(bin(b)[2:])
print(a & b) """